################################################################################
# Clock constraints
################################################################################
create_clock -name adr_p_1 -period 1.600 [get_ports {adr_p[1]}]       ;# 625 MHz
create_clock -name bdr_p_1 -period 1.600 [get_ports {bdr_p[1]}]       ;# 625 MHz
create_clock -name cdr_p_1 -period 1.600 [get_ports {cdr_p[1]}]       ;# 625 MHz
create_clock -name ddr_p_1 -period 1.600 [get_ports {ddr_p[1]}]       ;# 625 MHz

create_clock -name clk_to_fpga_p_1 -period 2.000 [get_ports {clk_to_fpga_p[1]}] ;#  500 MHz
create_clock -name ext_trigger_p_1 -period 100.0 [get_ports {ext_trigger_p[1]}] ;# 10 mhz

set_clock_groups -name adr_phy_clocks_1 -asynchronous -group [get_clocks -include_generated_clocks adr_p_1]
set_clock_groups -name bdr_phy_clocks_1 -asynchronous -group [get_clocks -include_generated_clocks bdr_p_1]
set_clock_groups -name cdr_phy_clocks_1 -asynchronous -group [get_clocks -include_generated_clocks cdr_p_1]
set_clock_groups -name ddr_phy_clocks_1 -asynchronous -group [get_clocks -include_generated_clocks ddr_p_1]
set_clock_groups -name clk_to_fpga_phy_clocks_1 -asynchronous -group [get_clocks -include_generated_clocks clk_to_fpga_p_1]

# VIRTUAL CLOCKS -> CLOCK WIZZARD
create_clock -period 8.000 -name VIRTUAL_axi_fmc126_clk125_1 -waveform {0.000 4.000}


################################################################################
# Input delay constraints
################################################################################

#Channel A
set_input_delay -clock [get_clocks adr_p_1] -clock_fall -min -add_delay 2.000 [get_ports {ad_p[1][*]}]
set_input_delay -clock [get_clocks adr_p_1] -clock_fall -max -add_delay 0.200 [get_ports {ad_p[1][*]}]
set_input_delay -clock [get_clocks adr_p_1] -clock_fall -min -add_delay 2.000 [get_ports {ad_n[1][*]}]
set_input_delay -clock [get_clocks adr_p_1] -clock_fall -max -add_delay 0.200 [get_ports {ad_n[1][*]}]
set_input_delay -clock [get_clocks adr_p_1] -clock_fall -min -add_delay 2.000 [get_ports {aor_p[1]}]
set_input_delay -clock [get_clocks adr_p_1] -clock_fall -max -add_delay 0.200 [get_ports {aor_n[1]}]
set_input_delay -clock [get_clocks adr_p_1] -clock_fall -min -add_delay 2.000 [get_ports {aor_p[1]}]
set_input_delay -clock [get_clocks adr_p_1] -clock_fall -max -add_delay 0.200 [get_ports {aor_n[1]}]

#Channel B
set_input_delay -clock [get_clocks bdr_p_1] -clock_fall -min -add_delay 2.000 [get_ports {bd_p[1][*]}]
set_input_delay -clock [get_clocks bdr_p_1] -clock_fall -max -add_delay 0.200 [get_ports {bd_n[1][*]}]
set_input_delay -clock [get_clocks bdr_p_1] -clock_fall -min -add_delay 2.000 [get_ports {bd_p[1][*]}]
set_input_delay -clock [get_clocks bdr_p_1] -clock_fall -max -add_delay 0.200 [get_ports {bd_n[1][*]}]
set_input_delay -clock [get_clocks bdr_p_1] -clock_fall -min -add_delay 2.000 [get_ports {bor_p[1]}]
set_input_delay -clock [get_clocks bdr_p_1] -clock_fall -max -add_delay 0.200 [get_ports {bor_n[1]}]
set_input_delay -clock [get_clocks bdr_p_1] -clock_fall -min -add_delay 2.000 [get_ports {bor_p[1]}]
set_input_delay -clock [get_clocks bdr_p_1] -clock_fall -max -add_delay 0.200 [get_ports {bor_n[1]}]

#Channel C
set_input_delay -clock [get_clocks cdr_p_1] -clock_fall -min -add_delay 2.000 [get_ports {cd_p[1][*]}]
set_input_delay -clock [get_clocks cdr_p_1] -clock_fall -max -add_delay 0.200 [get_ports {cd_n[1][*]}]
set_input_delay -clock [get_clocks cdr_p_1] -clock_fall -min -add_delay 2.000 [get_ports {cd_p[1][*]}]
set_input_delay -clock [get_clocks cdr_p_1] -clock_fall -max -add_delay 0.200 [get_ports {cd_n[1][*]}]
set_input_delay -clock [get_clocks cdr_p_1] -clock_fall -min -add_delay 2.000 [get_ports {cor_p[1]}]
set_input_delay -clock [get_clocks cdr_p_1] -clock_fall -max -add_delay 0.200 [get_ports {cor_n[1]}]
set_input_delay -clock [get_clocks cdr_p_1] -clock_fall -min -add_delay 2.000 [get_ports {cor_p[1]}]
set_input_delay -clock [get_clocks cdr_p_1] -clock_fall -max -add_delay 0.200 [get_ports {cor_n[1]}]

#Channel D
set_input_delay -clock [get_clocks ddr_p_1] -clock_fall -min -add_delay 2.000 [get_ports {dd_p[1][*]}]
set_input_delay -clock [get_clocks ddr_p_1] -clock_fall -max -add_delay 0.200 [get_ports {dd_n[1][*]}]
set_input_delay -clock [get_clocks ddr_p_1] -clock_fall -min -add_delay 2.000 [get_ports {dd_p[1][*]}]
set_input_delay -clock [get_clocks ddr_p_1] -clock_fall -max -add_delay 0.200 [get_ports {dd_n[1][*]}]
set_input_delay -clock [get_clocks ddr_p_1] -clock_fall -min -add_delay 2.000 [get_ports {dor_p[1]}]
set_input_delay -clock [get_clocks ddr_p_1] -clock_fall -max -add_delay 0.200 [get_ports {dor_n[1]}]
set_input_delay -clock [get_clocks ddr_p_1] -clock_fall -min -add_delay 2.000 [get_ports {dor_p[1]}]
set_input_delay -clock [get_clocks ddr_p_1] -clock_fall -max -add_delay 0.200 [get_ports {dor_n[1]}]

#Misc
set_input_delay -clock [get_clocks VIRTUAL_axi_fmc126_clk125_1] -min -add_delay 3.000 [get_ports prsnt_m2c_l[1]]
set_input_delay -clock [get_clocks VIRTUAL_axi_fmc126_clk125_1] -max -add_delay 4.500 [get_ports prsnt_m2c_l[1]]
set_input_delay -clock [get_clocks VIRTUAL_axi_fmc126_clk125_1] -min -add_delay 3.000 [get_ports pg_m2c[1]]
set_input_delay -clock [get_clocks VIRTUAL_axi_fmc126_clk125_1] -max -add_delay 4.500 [get_ports pg_m2c[1]]
#set_input_delay -clock [get_clocks VIRTUAL_axi_fmc126_clk125_1] -min -add_delay 3.000 [get_ports ext_trigger_p[1]]
#set_input_delay -clock [get_clocks VIRTUAL_axi_fmc126_clk125_1] -max -add_delay 4.500 [get_ports ext_trigger_p[1]]
#set_input_delay -clock [get_clocks VIRTUAL_axi_fmc126_clk125_1] -min -add_delay 3.000 [get_ports ext_trigger_n[1]]
#set_input_delay -clock [get_clocks VIRTUAL_axi_fmc126_clk125_1] -max -add_delay 4.500 [get_ports ext_trigger_n[1]]
set_input_delay -clock [get_clocks VIRTUAL_axi_fmc126_clk125_1] -clock_fall -min -add_delay 3.000 [get_ports fmc_to_cpld[1]]
set_input_delay -clock [get_clocks VIRTUAL_axi_fmc126_clk125_1] -clock_fall -max -add_delay 4.500 [get_ports fmc_to_cpld[1]]
#set_input_delay -clock [get_clocks VIRTUAL_axi_fmc126_clk125_1] -clock_fall -min -add_delay 3.000 [get_ports front_io_fmc[1][*]]
#set_input_delay -clock [get_clocks VIRTUAL_axi_fmc126_clk125_1] -clock_fall -max -add_delay 4.500 [get_ports front_io_fmc[1][*]]

################################################################################
# Output delay constraints
################################################################################

#Misc
set_output_delay -clock [get_clocks VIRTUAL_axi_fmc126_clk125_1] -clock_fall -min -add_delay 3.000 [get_ports fmc_to_cpld[1][*] ]
set_output_delay -clock [get_clocks VIRTUAL_axi_fmc126_clk125_1] -clock_fall -max -add_delay 4.500 [get_ports fmc_to_cpld[1][*] ]
#set_output_delay -clock [get_clocks VIRTUAL_axi_fmc126_clk125_1] -clock_fall -min -add_delay 3.000 [get_ports front_io_fmc[1][*]]
#set_output_delay -clock [get_clocks VIRTUAL_axi_fmc126_clk125_1] -clock_fall -max -add_delay 4.500 [get_ports front_io_fmc[1][*]]
set_output_delay -clock [get_clocks adr_p_1] -clock_fall -min -add_delay 3.000 [get_ports sync_from_fpga_n[1]]
set_output_delay -clock [get_clocks adr_p_1] -clock_fall -max -add_delay 4.500 [get_ports sync_from_fpga_n[1]]
set_output_delay -clock [get_clocks adr_p_1] -clock_fall -min -add_delay 3.000 [get_ports sync_from_fpga_p[1]]
set_output_delay -clock [get_clocks adr_p_1] -clock_fall -max -add_delay 4.500 [get_ports sync_from_fpga_p[1]]

################################################################################
# FMC signals (FMC126 on PC821 primary side)
################################################################################
set_property PACKAGE_PIN G14  [get_ports clk_to_fpga_n[1]]
set_property PACKAGE_PIN G15  [get_ports clk_to_fpga_p[1]]
set_property PACKAGE_PIN J15  [get_ports ext_trigger_n[1]]
set_property PACKAGE_PIN K15  [get_ports ext_trigger_p[1]]
set_property PACKAGE_PIN H18  [get_ports sync_from_fpga_n[1]]
set_property PACKAGE_PIN H19  [get_ports sync_from_fpga_p[1]]

set_property PACKAGE_PIN J13  [get_ports adr_n[1]]
set_property PACKAGE_PIN J14  [get_ports adr_p[1]]
set_property PACKAGE_PIN H13  [get_ports ad_n[1][0]]
set_property PACKAGE_PIN H14  [get_ports ad_p[1][0]]
set_property PACKAGE_PIN G12  [get_ports ad_n[1][1]]
set_property PACKAGE_PIN H12  [get_ports ad_p[1][1]]
set_property PACKAGE_PIN F13  [get_ports ad_n[1][2]]
set_property PACKAGE_PIN F14  [get_ports ad_p[1][2]]
set_property PACKAGE_PIN E12  [get_ports ad_n[1][3]]
set_property PACKAGE_PIN F12  [get_ports ad_p[1][3]]
set_property PACKAGE_PIN E15  [get_ports ad_n[1][4]]
set_property PACKAGE_PIN F15  [get_ports ad_p[1][4]]
set_property PACKAGE_PIN C14  [get_ports ad_n[1][5]]
set_property PACKAGE_PIN D14  [get_ports ad_p[1][5]]
set_property PACKAGE_PIN C13  [get_ports ad_n[1][6]]
set_property PACKAGE_PIN D13  [get_ports ad_p[1][6]]
set_property PACKAGE_PIN A14  [get_ports ad_n[1][7]]
set_property PACKAGE_PIN B14  [get_ports ad_p[1][7]]
set_property PACKAGE_PIN B12  [get_ports ad_n[1][8]]
set_property PACKAGE_PIN C12  [get_ports ad_p[1][8]]
set_property PACKAGE_PIN A15  [get_ports ad_n[1][9]]
set_property PACKAGE_PIN B15  [get_ports ad_p[1][9]]
set_property PACKAGE_PIN F23  [get_ports aor_n[1]]
set_property PACKAGE_PIN F24  [get_ports aor_p[1]]

set_property PACKAGE_PIN F19  [get_ports bdr_n[1]]
set_property PACKAGE_PIN G19  [get_ports bdr_p[1]]
set_property PACKAGE_PIN G17  [get_ports bd_n[1][0]]
set_property PACKAGE_PIN H17  [get_ports bd_p[1][0]]
set_property PACKAGE_PIN M15  [get_ports bd_n[1][1]]
set_property PACKAGE_PIN M16  [get_ports bd_p[1][1]]
set_property PACKAGE_PIN K17  [get_ports bd_n[1][2]]
set_property PACKAGE_PIN L17  [get_ports bd_p[1][2]]
set_property PACKAGE_PIN E16  [get_ports bd_n[1][3]]
set_property PACKAGE_PIN E17  [get_ports bd_p[1][3]]
set_property PACKAGE_PIN C16  [get_ports bd_n[1][4]]
set_property PACKAGE_PIN D16  [get_ports bd_p[1][4]]
set_property PACKAGE_PIN J16  [get_ports bd_n[1][5]]
set_property PACKAGE_PIN K16  [get_ports bd_p[1][5]]
set_property PACKAGE_PIN E20  [get_ports bd_n[1][6]]
set_property PACKAGE_PIN F20  [get_ports bd_p[1][6]]
set_property PACKAGE_PIN C17  [get_ports bd_n[1][7]]
set_property PACKAGE_PIN C18  [get_ports bd_p[1][7]]
set_property PACKAGE_PIN A19  [get_ports bd_n[1][8]]
set_property PACKAGE_PIN A20  [get_ports bd_p[1][8]]
set_property PACKAGE_PIN D18  [get_ports bd_n[1][9]]
set_property PACKAGE_PIN E18  [get_ports bd_p[1][9]]
set_property PACKAGE_PIN J23  [get_ports bor_n[1]]
set_property PACKAGE_PIN K23  [get_ports bor_p[1]]

set_property PACKAGE_PIN G21  [get_ports cdr_n[1]]
set_property PACKAGE_PIN G22  [get_ports cdr_p[1]]
set_property PACKAGE_PIN G24  [get_ports cd_n[1][0]]
set_property PACKAGE_PIN H24  [get_ports cd_p[1][0]]
set_property PACKAGE_PIN N23  [get_ports cd_n[1][1]]
set_property PACKAGE_PIN P23  [get_ports cd_p[1][1]]
set_property PACKAGE_PIN H22  [get_ports cd_n[1][2]]
set_property PACKAGE_PIN H23  [get_ports cd_p[1][2]]
set_property PACKAGE_PIN C21  [get_ports cd_n[1][3]]
set_property PACKAGE_PIN D21  [get_ports cd_p[1][3]]
set_property PACKAGE_PIN E21  [get_ports cd_n[1][4]]
set_property PACKAGE_PIN E22  [get_ports cd_p[1][4]]
set_property PACKAGE_PIN M22  [get_ports cd_n[1][5]]
set_property PACKAGE_PIN N22  [get_ports cd_p[1][5]]
set_property PACKAGE_PIN N21  [get_ports cd_n[1][6]]
set_property PACKAGE_PIN P21  [get_ports cd_p[1][6]]
set_property PACKAGE_PIN B21  [get_ports cd_n[1][7]]
set_property PACKAGE_PIN B22  [get_ports cd_p[1][7]]
set_property PACKAGE_PIN C22  [get_ports cd_n[1][8]]
set_property PACKAGE_PIN C23  [get_ports cd_p[1][8]]
set_property PACKAGE_PIN K20  [get_ports cd_n[1][9]]
set_property PACKAGE_PIN L20  [get_ports cd_p[1][9]]
set_property PACKAGE_PIN H21  [get_ports cor_n[1]]
set_property PACKAGE_PIN J21  [get_ports cor_p[1]]

set_property PACKAGE_PIN E30  [get_ports ddr_n[1]]
set_property PACKAGE_PIN F30  [get_ports ddr_p[1]]
set_property PACKAGE_PIN G30  [get_ports dd_n[1][0]]
set_property PACKAGE_PIN G29  [get_ports dd_p[1][0]]
set_property PACKAGE_PIN H29  [get_ports dd_n[1][1]]
set_property PACKAGE_PIN J29  [get_ports dd_p[1][1]]
set_property PACKAGE_PIN K33  [get_ports dd_n[1][2]]
set_property PACKAGE_PIN K32  [get_ports dd_p[1][2]]
set_property PACKAGE_PIN G32  [get_ports dd_n[1][3]]
set_property PACKAGE_PIN H32  [get_ports dd_p[1][3]]
set_property PACKAGE_PIN H31  [get_ports dd_n[1][4]]
set_property PACKAGE_PIN J30  [get_ports dd_p[1][4]]
set_property PACKAGE_PIN D31  [get_ports dd_n[1][5]]
set_property PACKAGE_PIN E31  [get_ports dd_p[1][5]]
set_property PACKAGE_PIN F29  [get_ports dd_n[1][6]]
set_property PACKAGE_PIN F28  [get_ports dd_p[1][6]]
set_property PACKAGE_PIN A29  [get_ports dd_n[1][7]]
set_property PACKAGE_PIN A28  [get_ports dd_p[1][7]]
set_property PACKAGE_PIN H33  [get_ports dd_n[1][8]]
set_property PACKAGE_PIN J33  [get_ports dd_p[1][8]]
set_property PACKAGE_PIN B29  [get_ports dd_n[1][9]]
set_property PACKAGE_PIN C29  [get_ports dd_p[1][9]]
set_property PACKAGE_PIN D33  [get_ports dor_n[1]]
set_property PACKAGE_PIN E32  [get_ports dor_p[1]]

set_property PACKAGE_PIN N24  [get_ports fmc_to_cpld[1][0]]
set_property PACKAGE_PIN M24  [get_ports fmc_to_cpld[1][1]]
set_property PACKAGE_PIN D34  [get_ports fmc_to_cpld[1][2]]
set_property PACKAGE_PIN C34  [get_ports fmc_to_cpld[1][3]]

set_property PACKAGE_PIN J34  [get_ports front_io_fmc[1][0]]
set_property PACKAGE_PIN H34  [get_ports front_io_fmc[1][1]]
set_property PACKAGE_PIN B34  [get_ports front_io_fmc[1][2]]
set_property PACKAGE_PIN A34  [get_ports front_io_fmc[1][3]]

set_property PACKAGE_PIN AY17 [get_ports pg_m2c[1]]
set_property PACKAGE_PIN AY18 [get_ports prsnt_m2c_l[1]]

set_property IOSTANDARD LVDS [get_ports {ad_n[1][*]}]
set_property DIFF_TERM_ADV=TERM_100 [get_ports {ad_n[1][*]}]
set_property IOSTANDARD LVDS [get_ports {ad_p[1][*]}]
set_property DIFF_TERM_ADV=TERM_100 [get_ports {ad_p[1][*]}]
set_property IOSTANDARD LVDS [get_ports {bd_n[1][*]}]
set_property DIFF_TERM_ADV=TERM_100 [get_ports {bd_n[1][*]}]
set_property IOSTANDARD LVDS [get_ports {bd_p[1][*]}]
set_property DIFF_TERM_ADV=TERM_100 [get_ports {bd_p[1][*]}]
set_property IOSTANDARD LVDS [get_ports {cd_n[1][*]}]
set_property DIFF_TERM_ADV=TERM_100 [get_ports {cd_n[1][*]}]
set_property IOSTANDARD LVDS [get_ports {cd_p[1][*]}]
set_property DIFF_TERM_ADV=TERM_100 [get_ports {cd_p[1][*]}]
set_property IOSTANDARD LVDS [get_ports {dd_n[1][*]}]
set_property DIFF_TERM_ADV=TERM_100 [get_ports {dd_n[1][*]}]
set_property IOSTANDARD LVDS [get_ports {dd_p[1][*]}]
set_property DIFF_TERM_ADV=TERM_100 [get_ports {dd_p[1][*]}]

set_property IOSTANDARD LVCMOS18 [get_ports {fmc_to_cpld[1][*]}]
set_property DRIVE 12  [get_ports {fmc_to_cpld[1][*]}]
set_property SLEW SLOW [get_ports {fmc_to_cpld[1][*]}]
set_property IOSTANDARD LVCMOS18 [get_ports {front_io_fmc[1][*]}]
set_property DRIVE 12  [get_ports {front_io_fmc[1][*]}]
set_property SLEW SLOW [get_ports {front_io_fmc[1][*]}]

set_property IOSTANDARD LVDS [get_ports {clk_to_fpga_n[1]}]
set_property DIFF_TERM_ADV=TERM_100 [get_ports {clk_to_fpga_n[1]}]
set_property IOSTANDARD LVDS [get_ports {clk_to_fpga_p[1]}]
set_property DIFF_TERM_ADV=TERM_100 [get_ports {clk_to_fpga_p[1]}]
set_property IOSTANDARD LVDS [get_ports {ext_trigger_n[1]}]
set_property DIFF_TERM_ADV=TERM_100 [get_ports {ext_trigger_n[1]}]
set_property IOSTANDARD LVDS [get_ports {ext_trigger_p[1]}]
set_property DIFF_TERM_ADV=TERM_100 [get_ports {ext_trigger_p[1]}]

set_property IOSTANDARD LVDS [get_ports sync_from_fpga_n[1]]
set_property IOSTANDARD LVDS [get_ports sync_from_fpga_p[1]]

set_property IOSTANDARD LVDS [get_ports adr_n[1]]
set_property DIFF_TERM_ADV=TERM_100 [{get_ports adr_n[1]}]
set_property IOSTANDARD LVDS [get_ports adr_p[1]]
set_property DIFF_TERM_ADV=TERM_100 [{get_ports adr_p[1]}]
set_property IOSTANDARD LVDS [get_ports aor_n[1]]
set_property DIFF_TERM_ADV=TERM_100 [{get_ports aor_n[1]}]
set_property IOSTANDARD LVDS [get_ports aor_p[1]]
set_property DIFF_TERM_ADV=TERM_100 [{get_ports aor_p[1]}]
set_property IOSTANDARD LVDS [get_ports bor_n[1]]
set_property DIFF_TERM_ADV=TERM_100 [{get_ports bor_n[1]}]
set_property IOSTANDARD LVDS [get_ports bor_p[1]]
set_property DIFF_TERM_ADV=TERM_100 [{get_ports bor_p[1]}]
set_property IOSTANDARD LVDS [get_ports cor_n[1]]
set_property DIFF_TERM_ADV=TERM_100 [{get_ports cor_n[1]}]
set_property IOSTANDARD LVDS [get_ports cor_p[1]]
set_property DIFF_TERM_ADV=TERM_100 [{get_ports cor_p[1]}]
set_property IOSTANDARD LVDS [get_ports dor_n[1]]
set_property DIFF_TERM_ADV=TERM_100 [{get_ports dor_n[1]}]
set_property IOSTANDARD LVDS [get_ports dor_p[1]]
set_property DIFF_TERM_ADV=TERM_100 [{get_ports dor_p[1]}]

set_property IOSTANDARD LVDS [get_ports adr_n[1]]
set_property IOSTANDARD LVDS [get_ports adr_p[1]]
#set_property IOSTANDARD LVCMOS18 [get_ports bdr_n[1]]
#set_property IOSTANDARD LVCMOS18 [get_ports bdr_p[1]]
#set_property IOSTANDARD LVCMOS18 [get_ports cdr_n[1]]
#set_property IOSTANDARD LVCMOS18 [get_ports cdr_p[1]]
#set_property IOSTANDARD LVCMOS18 [get_ports ddr_n[1]]
#set_property IOSTANDARD LVCMOS18 [get_ports ddr_p[1]]

set_property IOSTANDARD LVCMOS33 [get_ports pg_m2c[1]]
set_property IOSTANDARD LVCMOS33 [get_ports prsnt_m2c_l[1]]
